
''' 1 - Еда
	2 - Стена
	3 - Голова
	4 - Тело
	5 - Тело 2
	0 - Пусто '''

		 # Первый скин (0 индекс)
COLORS = [{1: (255, 0, 0), # Красная еда
		   2: (133, 133, 133), # Серая стена
		   3: (16, 163, 16), # Зеленая голова
		   4: (23, 27, 40), # Тело 1 "Графитно-черный"
		   5: (3, 79, 3), # Тело 2 "Темно-Зеленый"
		   0: (0, 0, 0)}, # Белый фон
		 # Второй скин (1 индекс)
		  {1: (255, 0, 0), # Красная еда
		   2: (133, 133, 133), # Серая стена
		   3: (219, 242, 15), # Голова "Желтая сера"
		   4: (255, 77, 0), # Тело 1 "Киноварь"
		   5: (128, 128, 0), # Тело 2 "Оливковый"
		   0: (0, 0, 0)}, # Белый фон
		 # Третий скин (2 индекс)
		  {1: (255, 0, 0), # Красная еда
		   2: (133, 133, 133), # Серая стена
		   3: (250, 255, 255), # Белая голова
		   4: (192, 64, 0), # Тело 1 "Красное дерево"
		   5: (220, 220, 220), # Тело 2 "Гейнсборо"
		   0: (0, 0, 0)}] # Белый фон


from pickle import load


def unload(file_name):
	with open(file_name, 'rb') as file:
		return load(file)


MAPS = [unload('data/LVL1.pickle'),
		unload('data/LVL2.pickle'),
		unload('data/LVL3.pickle'),
		unload('data/LVL4.pickle'),
		unload('data/LVL5.pickle')]